#             Функціонал: Пошук та купівля смартфону Samsung M51

#             Передумова:
#             При умові, що Користувач відкриває веб-сайт "Розетка"

#             Сценарій: Пошук смартфону Samsung M51 на веб-сайті "Розетка"
#             При умові, що Користувач вводить "<модель_телефону>" у поле пошуку
#             Коли зявляється список товарів, що відповідають запиту
#             Тоді Користувач вибирає смартфон "<модель_телефону>" зі списку
#             Тоді відкривається сторінка товару зі згаданим смартфоном
#             Тоді інформація про смартфон "<модель_телефону>" відображається на сторінці товару
#             Тоді кнопка "Купити" присутня на сторінці товару

#             Приклади:
#             | модель_телефону |
#             | Samsung M51     |

# Сценарій: Купівля смартфону Samsung M51 на веб-сайті "Розетка"
# При умові, що Користувач відкриває сторінку товару Samsung M51 на веб-сайті "Розетка"
# Тоді інформація про смартфон Samsung M51 відображається на сторінці товару
# Тоді кнопка "Купити" присутня на сторінці товару
# Коли Користувач натискає кнопку "Купити"
# Тоді Користувач перевіряє, чи авторизований
# Коли Користувач авторизований
# Тоді товар додається до кошика
# Коли Користувач переходить до кошика
# Тоді відкривається сторінка кошика з доданим товаром
# Тоді товар Samsung M51 присутній в кошику
# Коли Користувач оформляє замовлення
# Тоді з'являється підтвердження успішного оформлення замовлення
# Останній варіант що перекладено ну англ.
#             Функціонал: Пошук та купівля смартфону Samsung M51

#             Передумова:
#             За умови, що Користувач відкриває веб-сайт "Розетка"

#             Сценарій узагальнення: Пошук смартфону Samsung M51 на веб-сайті "Розетка"
#             За умови, що Користувач вводить "<модель_телефону>" у поле пошуку
#             Коли зявляється список товарів, що відповідають запиту
#             Тоді Користувач вибирає смартфон "<модель_телефону>" зі списку
#             Тоді відкривається сторінка товару зі згаданим смартфоном
#             Тоді інформація про смартфон "<модель_телефону>" відображається на сторінці товару
#             Тоді кнопка "Купити" присутня на сторінці товару
#             Тоді вартість смартфону "<модель_телефону>" складає "<ціна_телефону>"

#             Приклади:
#             | модель_телефону | ціна_телефону |
#             | Samsung M51     | 9000          |
#             | Samsung M31     | 8000          |

# Сценарій: Купівля смартфону Samsung M51 на веб-сайті "Розетка"
# За умови, що Користувач відкриває сторінку товару Samsung M51 на веб-сайті "Розетка"
# Тоді інформація про смартфон Samsung M51 відображається на сторінці товару
# Тоді кнопка "Купити" присутня на сторінці товару
# Тоді вартість смартфону Samsung M51 складає 9000
# Коли Користувач натискає кнопку "Купити"
# Тоді Користувач перевіряє, чи авторизований
# Коли Користувач авторизований
# Тоді товар додається до кошика
# Коли Користувач переходить до кошика
# Тоді відкривається сторінка кошика з доданим товаром
# Тоді смартфон Samsung MТоді товар Samsung M51 присутній в кошику
# Коли Користувач оформляє замовлення
# Тоді Відображається підтвердження успішного оформлення замовлення

