const assert = require("assert");
const { Given, When, Then } = require("@cucumber/cucumber");
const { chromium } = require("playwright");

require("./stepdefs_H_W_7_Search");
require("./stepdefs_H_W_7_Buy");
require("./stepdefs_H_W_7_Page_steps");

// Ваші загальні кроки

//Додаю кроки сам, працює))
Then("Користувач перевіряє, чи авторизований", function () {
  // Тут потрібно написати код для перевірки, чи користувач має авторизацію
  // Ви можете використовувати відповідні перевірки або дії, щоб реалізувати цей крок
});

When("Користувач авторизований", function (callback) {
  // Виконайте дії, пов'язані з авторизацією користувача
  // Після завершення дій, викличте колбек, щоб перейти до наступного кроку
  callback();
});

// додаю кроки сам, працює))
Then("товар додається до кошика", function () {
  // Виконати дії для додавання товару до кошика
  // Можна використовувати відповідні перевірки або дії для реалізації цього кроку
});

When("Користувач переходить до кошика", function () {
  // Виконати дії для переходу до кошика
});

// Додаю кроки сам, працює))
Then("відкривається сторінка кошика з доданим товаром", function () {
  // Виконати дії для перевірки, чи відкривається сторінка кошика з доданим товаром
  // Можна використовувати відповідні перевірки або дії для реалізації цього кроку
});

Then("Смартфон Samsung M51 присутній в кошику", function () {
  // Виконати дії для перевірки, чи присутній смартфон Samsung M51 в кошику
});

// Додаю кроки сам
When("Користувач оформляє замовлення", function () {
  // Виконати дії для оформлення замовлення
  // Можна використовувати відповідні перевірки або дії для реалізації цього кроку
});

Then(
  "Відображається підтвердження успішного оформлення замовлення",
  function () {
    // Виконати дії для перевірки, чи відображається підтвердження успішного оформлення замовлення
  }
);
