// const assert = require("assert");
// const { Given, When, Then } = require("@cucumber/cucumber");
// const { chromium } = require("playwright");

// let page;
// let websiteUrl = "https://www.rozetka.com.ua";

// Given("Користувач відкриває веб-сайт {string}", async function (website) {
//   const browser = await chromium.launch();
//   page = await browser.newPage();
//   await page.goto(websiteUrl);
// });

// Given("Користувач вводить {string} у поле пошуку", async function (searchTerm) {
//   // Ваш код для введення тексту в поле пошуку
// });

// When(
//   "Відображається список продуктів, що відповідають запиту",
//   async function () {
//     // Ваш код для перевірки відображення списку продуктів, що відповідають запиту
//   }
// );

// // Додайте сюди загальні кроки, що використовуються в обох сценаріях

// // Додаю кроки сам, цей працює))
// Then("Користувач вибирає смартфон {string} зі списку", function (string) {
//   // Виконати дії, щоб вибрати смартфон зі списку
// });

// // Додаю кроки сам, цей працює))
// Then(
//   "на сторінці продукту відображається інформація про смартфон {string}",
//   function (string) {
//     // Виконати перевірку, що на сторінці продукту відображається інформація про смартфон з вказаним назвою
//   }
// );
// // Додаю кроки сам, цей працює))
// Then("на сторінці продукту присутня кнопка {string}", function (string) {
//   // Виконати перевірку, що на сторінці продукту присутня кнопка з вказаним текстом
// });
// // Додаю кроки сам, цей працює))

// Then("ціна смартфона {string} становить {string}", function (string1, string2) {
//   // Виконати перевірку, що ціна смартфона з вказаним назвою відповідає вказаній ціні
// });

// // Додаю кроки сам,
// Given(
//   "Користувач відкриває сторінку продукту {string} на веб-сайті {string}",
//   function (string1, string2) {
//     // Виконати дії, щоб відкрити сторінку продукту з вказаною моделлю телефону на веб-сайті
//   }
// );
// // Додаю кроки сам,
// Then(
//   "інформація про смартфон {string} відображається на сторінці продукту",
//   function (string) {
//     // Виконати перевірку, що на сторінці продукту відображається інформація про смартфон з вказаною моделлю
//   }
// );

// // додаю сам, працює))

// Then("кнопка 'Buy' присутня на сторінці продукту", function () {
//   // Виконати перевірку, що кнопка 'Buy' присутня на сторінці продукту
// });

// Then("ціна смартфона Samsung M51 - 9000", function () {
//   // Виконати перевірку, що ціна смартфона Samsung M51 дорівнює 9000
// });

// When("Користувач натискає кнопку 'Buy'", function () {
//   // Виконати дії, щоб користувач натиснув кнопку 'Buy'
// });

// // додаю сам
// // When("Користувач авторизований", function (callback) {
// //   // Виконайте дії, пов'язані з авторизацією користувача
// //   // Після завершення дій, викличте колбек, щоб перейти до наступного кроку
// //   callback();
// // });
