// const { Then } = require("@cucumber/cucumber");

// Then("на сторінці продукту відображається назва продукту", async function () {
//   // Ваш код для перевірки відображення назви продукту на сторінці продукту
// });

// Then("на сторінці продукту відображається опис продукту", async function () {
//   // Ваш код для перевірки відображення опису продукту на сторінці продукту
// });

// Then(
//   "на сторінці продукту відображається зображення продукту",
//   async function () {
//     // Ваш код для перевірки відображення зображення продукту на сторінці продукту
//   }
// );

// // Додаю кроки сам
